Repository: CyberFazaN/wayback-fetcher
Catalog: locale/*/LC_MESSAGES/wayback_fetcher.po
Languages: ru

source: Must be a valid domain: {domain}
ru: Ожидался корректный домен: {domain}

source: Must be an integer
ru: Ожидалось целое число

source: Value must be between {minimum} and {maximum}
ru: Значение должно быть между {minimum} и {maximum}

source: Download files from WayBack Machine archive for a given domain with optional filtration.
ru: Загрузка файлов из веб-архива WayBack Machine по домену с дополнительной фильтрацией.

source: Main options
ru: Основные опции

source: Target domain (e.g. example.com).
ru: Целевой домен (к примеру, example.com).

source: Max records to fetch from API.
ru: Лимит загрузки записей индекса.

source: Use HTTP instead of HTTPS for WayBack connection.
ru: Использовать HTTP вместо HTTPS для запросов к WayBack Machine.

source: Output folder. Default: {default_output}
ru: Путь к папке для сохранения данных. По-умолчанию: {default_output}

source: Output format. Both means CSV+JSON.
ru: Формат сохранения метаданных. Both означает CSV+JSON.

source: Verbose mode.
ru: Режим вывода отладочной информации.

source: Filtering options
ru: Опции фильтрации

source: Comma-separated list of extensions.
ru: Расширения файлов для фильтрации загрузок, разделение через запятую.

source: Comma-separated list of mimetypes.
ru: MIME-типы файлов для фильтрации загрузок, разделение через запятую.

source: Regular expression for filtering file by their URL-paths.
ru: Регулярное выражение для фильтрации загрузок по их URL-путям.

source: Comma-separated list of HTTP status codes for archive filter.
ru: HTTP-коды ответа для фильтрации индекса, разделение через запятую.

source: Download options
ru: Опции загрузок

source: Download all matching files. Alias for -dfl -dc.
ru: Загружать все соответствующие файлы. Аналог -dfl -dc.

source: Download first archived file.
ru: Загружать первые файлы из веб-архива.

source: Download last archived file.
ru: Загружать последние файлы из веб-архива.

source: Download both first and last archived files.
ru: Загружать первые и последние файлы из веб-архива. Аналог -df -dl.

source: Download current version of file from origin.
ru: Загружать текущие версии файлов с оригинального сайта.

source: Save files in a structured way.
ru: Сохранять структуру веб-сайта при загрузке файлов.

source: Threads for downloading (1–64).
ru: Количество потоков на загрузку (1-64).

source: Timeout for all downloads. Alias for -dtw x -dto x.
ru: Таймаут для всех загрузок. Аналог -dtw x -dto x.

source: Timeout for wayback downloads.
ru: Таймаут для загрузок из веб-архива.

source: Timeout for origin downloads.
ru: Таймаут для загрузок с оригинального сайта.

source: Number of retries for failed downloads.
ru: Количество повторных попыток загрузки при возникновении ошибок.

source: Delay between retries (seconds).
ru: Период задержки между повторными попытками загрузки (секунды).

source: Deduplicate downloaded files (the latest copy will survive).
ru: Найти и удалить дубликаты загруженных файлов (сохраняет самые последние копии).

source: Localization
ru: Локализация

source: Force Russian output.
ru: Использовать русский язык.

source: Domain is required.
ru: Необходимо указать домен.

source: Fetching archive index...
ru: Получение индекса веб-архива...

source: Error while fetching archive index ({exception})
ru: Не удалось получить индекс веб-архива ({exception})

source: Deleting: {filepath}
ru: Удаление: {filepath}

source: File {latest} has {duplicates_count} duplicates: {duplicates}
ru: Файл {latest} имеет {duplicates_count} дубликат(-а/-ов): {duplicates}

source: Saved: {url} -> {filepath}
ru: Сохранено: {url} -> {filepath}

source: Error while downloading {url} ({exception})
ru: Ошибка при загрузке {url} ({exception})

source: Error ({exception}) while downloading {url}, retrying
ru: Ошибка ({exception}) при загрузке {url}, пробую снова

source: Output saved to {output_folder}
ru: Данные сохранены в {output_folder}

source: Nothing to save.
ru: Нет данных для сохранения.

source: WayBack File Fetcher finished.
ru: WayBack File Fetcher завершил работу.

source: Author: FazaN (https://t.me/CyberFazaN)
ru: Автор: FazaN (https://t.me/CyberFazaN)

source: Using language: {lang_code}
ru: Используется локаль: {lang_code}

source: Given arguments: {args}
ru: Полученные аргументы: {args}

source: WayBack Machine returned empty result. Probably, the archive is empty.
ru: WayBack Machine вернул пустой ответ. Возможно, данный сайт ещё не архивировался.

source: Index fetched! Summary:
ru: Индекс архива загружен. Сводка:

source: Total: {total}, Targets: {targets}, With multiple versions: {multiple}
ru: Всего: {total}, Целевых: {targets}, С разными версиями: {multiple}

source: Nothing to download: no target records found.
ru: Не наййдено ни одного файла, соответствующего условиям фильтрации. Загрузка пропущена.

source: No filtering applied. This will download whole archive. It may take a long time.
ru: Не применены правила фильтрации. Будет загружен весь архив. Это может занять какое-то время.

source: Do you want to continue?
ru: Желаете продолжить?

source: (y/N)
ru: (д/Н)

source: Aborted.
ru: Исполнение программы прервано.

source: Start downloading desired files ({files_count})...
ru: Начало загрузки выбранных файлов ({files_count})...

source: Note that quantity of files to download is higher than quantity of target records. This is normal as we will download multiple versions of these files.
ru: Обратите внимание, что количество файлов для загрузки превышает количество целевых записей. Это нормально, так как мы будем загружать несколько версий этих файлов.

source: Download complete.
ru: Загрузка завершена.

source: Successfully downloaded {successful_count} files.
ru: Успешно загружено: {successful_count} файл(-а/-ов).

source: Failed to download {unsuccessful_count} files.
ru: Не удалось загрузить {unsuccessful_count} файл(-а/-ов).

source: Searching for duplicates in downloaded files ({files_count})...
ru: Поиск дубликатов в загруженных файлах ({files_count})...

source: Found {duplicates_count} duplicates. Deleting...
ru: Обнаружено {duplicates_count} дубликат(-а/-ов). Удаление...

source: Deduplication complete.
ru: Удаление дубликатов завершено.
